import {BrowserRouter as Router, Route, Switch, Link } from "react-router-dom";
import './App.css';


function Main (){
  let maininfo = `Чернівці́ — адміністративний, політичний і релігійний центр Чернівецької області, важливий культурний та науково-освітній осередок України. Місто розміщене на південному заході України за 40 км від румунського кордону. Чисельність населення міста становить 266,5 тис. осіб (2019). Територія Чернівців становить 153 км². Місто — центр Чернівецької агломерації, населення якої складає 723,1 тис. осіб.

  Чернівці — історична столиця Буковинського краю, місто відоме своїми архітектурними ансамблями, одну з яких — пам'ятку архітектури «Резиденція митрополитів Буковини і Далмації» — включено до списку Світової спадщини ЮНЕСКО.
  
  Місто кілька разів посідало чільні місця у різноманітних рейтингах туристичної привабливості, комфортності проживання тощо. У наш час за містом закріпився неофіційний статус — «Пісенна столиця України».`
  let mainifo2 = `Впродовж віків Чернівці сформувались як місто з унікальною різностильовою архітектурою, багатою культурною спадщиною і толерантною атмосферою. Його планування при значних перепадах у рельєфі створює розмаїття краєвидів, обрій яких ускладнюють куполи храмів різних конфесій та годинникова вежа міської ратуші. Вгору від річки Прут тягнуться старовинні вулички, звивисті, зламані крутими поворотами. На пологій частині схилу вони утворюють густу вуличну мережу, прорізану широкими магістралями, що ведуть до Центральної площі Чернівців. Екскурсія історичним середмістям австрійської доби дасть змогу ознайомитися з архітектурним ансамблем XIX — початку XX століть, який відомий своїми стильними сецесійними будовами, створеними представниками віденської школи модерну Отто Вагнера. Архітектурною перлиною Чернівців по праву вважається ансамбль колишньої Резиденції митрополитів Буковини і Далмації, включений до списку об'єктів всесвітньої культурної 
  спадщини UNESCO. Чернівці - Париж України`
  return(
  <>
  <div className="box1">
    <div className="sign"></div>
    <div className="information">
      <p>{maininfo}</p>
      <p>{mainifo2}</p>
    </div>
  </div>
  </>
  )};
function MainLandmarks (){
  let landmarkinfo = `Резиде́нція митрополи́тів Букови́ни і Далма́ції — пам'ятка архітектури, розташована у місті Чернівці. Комплекс збудований у 1864—1882 роках. Архітектор — Йозеф Главка. Після Другої світової війни його будівлі використовує Чернівецький національний університет імені Юрія Федьковича.

  З 24 серпня 1963 року є пам'яткою архітектури національного значення (ох. № 778/0).
  
  28 червня 2011 року на 35-й сесії комітету ЮНЕСКО архітектурний ансамбль резиденції (англ. Residence of Bukovinian and Dalmatian Metropolitans) включили до списку Світової спадщини.
  
  За підсумками загальнонаціональної акції «Сім чудес України: замки, фортеці, палаци» 2010—2011 року, митрополича резиденція потрапила до першої сімки.`
let landmarkinfo2 = `Резиденцію митрополитів Буковини і Далмації, що стала яскравим зразком постромантичних тенденцій в архітектурі, збудовано в дусі еклектики.

Комплекс чітко спланований і лаконічний, у своїй сукупності нагадує середньовічний замок. Двір з трьох боків замкнутий корпусами, які утворюють парадний курдонер, що нагадує своєрідний бароковий церемоніальний двір.

Архітектурний ансамбль приваблює своїм незвичним виглядом. Вражаючими є практично всі архітектурні елементи — високі цегляні стіни, оздоблені червоною теракотою і різьбленим каменем; стрункі вежі, торці будівель і ризаліти, завершені високими зубцями; круті схили дахів, критих викладеною узором поливаною черепиці білого, голубого, зеленого і коричневого кольорів; вишукані ажурні ковані решітки тощо.`;  
  return(
  <>
    <div className="box1">
      <div className="photo"></div>
      <div className="information2">
        <p>{landmarkinfo}</p>
        <p>{landmarkinfo2}</p>
      </div>
  </div>
  </>
)};
function Landmarks (){
  let i =0;
  let listland =[
    `Чернівецький академічний обласний український музично-драматичний театр імені Ольги Кобилянської — державний заклад культури, діяльність якого спрямована на створення, публічне виконання та показ творів театрального мистецтва. Розміщується у будинку міського театру Чернівців.

    Заснований у 1940 році на базі Харківського державного театру революції як «Чернівецький державний український драматичний театр». З 1954 року — «Чернівецький обласний український музично-драматичний театр імені Ольги Кобилянської». 22 липня 2008 року театр отримав статус «Академічного».`,
    `Буковинський державний медичний університет — один із найбільших закладів вищої освіти м. Чернівці, який у 2021 році святкуватиме 90-річчя від дня заснування. Це сучасний багатопрофільний заклад вищої медичної освіти, включений до загального реєстру Всесвітньої організації охорони здоров'я, Великої Хартії університетів, Європейської асоціації університету, що здійснює підготовку здобувачів вищої освіти за ступеневою системою освіти.

    Становлення і розвиток БДМУ пов'язані з іменами відомих вчених та організаторів. Випускники БДМУ успішно реалізовують себе в медичній, фармацевтичній, економічній, освітній, науковій, соціальній та культурній сферах діяльності. БДМУ пишається своїми випускниками, чимало з яких досягнули значних вершин у професійному та громадському житті.
    В університеті здійснюється підготовка здобувачів вищої освіти на початковому, першому (бакалаврському), другому (магістерському) та третьому (освітньо-науковому) рівнях за галузями знань «Охорона здоров'я» («Медицина», «Фармація») та «Біологія» за 24 спеціальностями. Навчання іноземних громадян здійснюється англійською та українською мовами.`,
    "Площа Філармонії, колишній готель Брістоль",
    "Вулиця Головна, Будинок-корабель",
    `Найгарнішою спорудою цієї площі та Чернівців є Чернівецький театр імені Ольги Кобилянської. «Чернівецький театр — то пам'ятник обізнаним з культурою чернівчанам, які понад усе боялись набути репутації провінції і палко прагнули ні в чому не поступатися шановному метрополю Відню». Так писав німецький письменник Георг Гайнцен. Праворуч від театру розташований будинок колишнього Єврейського народного дому, споруджений у 1908 році у псевдобарокковському стилі за проектом львівського архітектора Тадеуша Левандовського. Поруч із ним стоїть пам'ятка архітектури епохи конструктивізму — колишній Румунський народний дім, збудований 1940 року за проектом Іона Нанеску. На протилежному боці, в оточенні двох будинків-близнюків, красується будинок торговельно-промислової палати, споруджений 1910 року в стилі модерн (зараз тут знаходиться адміністративний корпус Буковинського державного медичного університету).`,
    "Кстел Серце Ісуса",
    "Резиденція Буковинських митрополитів, Головний корпус",
  ]
  let listOfImg = ['1.jpg','2.jfif','3.jpg','4.jpg','5.jfif','6.jpg', '7.jpg'];
function leftImg0(){
      i -= 1;
        if(i<0){
            i=0;
        }
        if(i>0){
          document.getElementById("leftImg").style.opacity = 1;  
        }
        if(i<1){
          document.getElementById("leftImg").style.opacity = 0.5;  
        }
        if(i<6){
          document.getElementById("rightImg").style.opacity = 1;
        }
      document.getElementById("image").style.backgroundImage='url('+listOfImg[i]+')';
      document.querySelector(".information3").textContent = listland[i];
};
function rightImg0(){
      i += 1;
      if(i>6){
            i=6;
        }
        if(i>5){
          document.getElementById("rightImg").style.opacity = 0.5; 
        }
        if(i>0){
          document.getElementById("leftImg").style.opacity = 1; 
        }
      document.getElementById("image").style.backgroundImage='url('+listOfImg[i]+')'; 
      document.querySelector(".information3").textContent = listland[i];
};
  return(
  <>
   <div className="box1">
      <div className="photobox">
      <div id="leftImg" onClick={leftImg0}>&lArr;</div>
        <div id="image"></div>
        <div id="rightImg" onClick={rightImg0}>&rArr;</div>
      </div>
      <div className="information3">
        <p>{listland[1]}</p>
      </div>
  </div>
  </>
)};
function Photo (){
  let i =0;
  let listOfImg = ['1.jpg','2.jfif','3.jpg','4.jpg','5.jfif','6.jpg', '7.jpg'];
  function leftImg0(){
        i -= 1;
          if(i<0){
              i=0;
          }
          if(i>0){
            document.getElementById("leftImg").style.opacity = 1;  
          }
          if(i<1){
            document.getElementById("leftImg").style.opacity = 0.5;  
          }
          if(i<6){
            document.getElementById("rightImg").style.opacity = 1;
          }
        document.getElementById("image1").style.backgroundImage='url('+listOfImg[i]+')';
  };
  function rightImg0(){
        i += 1;
        if(i>6){
              i=listOfImg.length;
          }
          if(i>5){
            document.getElementById("rightImg").style.opacity = 0.5; 
          }
          if(i>0){
            document.getElementById("leftImg").style.opacity = 1; 
          }
        document.getElementById("image1").style.backgroundImage='url('+listOfImg[i]+')'; 
  };
  return(
  <>
      <div className="photobox1">
      <div id="leftImg" onClick={leftImg0}>&lArr;</div>
        <div id="image1"></div>
        <div id="rightImg" onClick={rightImg0}>&rArr;</div>
      </div>
      <form className="form" method="GET" action="">
        <span>Nicname</span><br></br>
        <input type="text" required></input><br></br>
        <span>Password</span><br></br>
        <input type="password" required></input><br></br>
        <span>Email</span><br></br>
        <input type="text" required></input><br></br>
        <span>Chose any photo</span><br></br>
        <input type="file" required></input><br></br>
        <span>Опишіть фото</span><br></br>
        <textarea ></textarea><br></br>
        <span>#tags</span><br></br>
        <input type="text" required></input><br></br>
        <input type="submit" value="SEND"></input>
      </form>
  </>
)};
function Notfoud (){
  return(
  <>
    <span>NOT FOUND</span>
  </>
)};
function NavMenu (){
  return(
  <>
    <Link to="/" className="links">
    Головна
    </Link>
    <Link to="/mainlandmark" className="links">
    Резиденція Митрополита
    </Link>
    <Link to="/landmarks" className="links">
    Визначні місця
    </Link>
    <Link to="/photo" className="links">
    Фото міста
    </Link>
  </>
)};
function Header (){
  return(
  <>
    <div className="header">
      <div className="flag"></div>
      <span className="city">Chernivtsi</span>
    </div>
  </>
  )};  
function App() {
  return (
    <Router>
      <Header />
      <NavMenu />
      <Switch>
        <Route exact path="/" component={Main} />
        <Route path="/mainlandmark" component={MainLandmarks} />
        <Route path="/landmarks" component={Landmarks} />
        <Route path="/photo" component={Photo} />
        <Route component={Notfoud} />
      </Switch>
    </Router>
  );
}

export default App;
